# Проект FitLife - MVP версия 1.0

# Константа, минимальное количество мл. на кг веса
WATER_PER_KG = 30
# Константа, обьём воды в мл.
WATER_VOLUME = 1000

# Знакомство
user_name = input('Здравствуйте, напишите ваше имя: ')
user_age = int(input('Введите ваш возраст: '))

# Сбор данных
user_weight = float(input('Введите свой вес (в кг): '))
user_height = float(input('Введите рост в метрах через точку: 1.75: '))

# Расчёт ИМТ и округление до 1 знака после запятой:
bmi = round((user_weight / (user_height ** 2)), 1)

# Расчёт рекомендуемого портебления воды и округление до 1 знака полсе запятой
water_needed = round(((user_weight * WATER_PER_KG) / WATER_VOLUME), 1)

# Вывод красивого результата
print(f"Приветствую вас, {user_name}!")
print(f"Ваш возарст: {user_age} г.")
print(f"Ваш Индекс Массы Тела (ИМТ): {bmi}")
print(f"Рекомендуемая норма потребления воды: {water_needed} л. в день")
print("Расчет окончен. Будьте здоровы!")
