# Проект FitLife - MVP версия 1.0

# Константа, минимальное количество мл. на кг веса
WATER_PER_KG = 30
# Константа, показывает сколько мл в 1 литре. # Исправил!
ML_PER_LITER = 1000

# Знакомство. # Добавил .strip()
user_name = input("Здравствуйте, напишите ваше имя: ").strip()
user_age = int(input("Введите ваш возраст: "))

# Сбор данных
user_weight = float(input("Введите свой вес (в кг): "))
user_height = float(input("Введите рост в метрах через точку: 1.75: "))

# Расчёт ИМТ и округление до 1 знака после запятой:
bmi = round((user_weight / (user_height ** 2)), 1)

# Расчёт рекомендуемого портебления воды и округление до 1 знака полсе запятой
water_needed = round(((user_weight * WATER_PER_KG) / ML_PER_LITER), 1)

# Вывод красивого результата
print(f"Приветствую вас, {user_name}!")
print(f"Ваш возраст: {user_age} г.")
print(f"Ваш Индекс Массы Тела (ИМТ): {bmi}")
print(f"Рекомендуемая норма потребления воды: {water_needed} л. в день")
print("Расчет окончен. Будьте здоровы!")
# Исправил кавычки, поставил везде двойные.
